cask_args appdir: '/Applications' # Set the default installation directory for cask apps

tap 'homebrew/bundle'             # Tap the Homebrew Bundle repository
tap 'teamookla/speedtest'         # Tap the Speedtest CLI repository

brew 'coreutils'                  # Install GNU core utilities
brew 'moreutils'                  # Install additional Unix utilities
brew 'findutils'                  # Install GNU find, locate, updatedb, and xargs
brew 'vim'                        # Install Vim text editor
brew 'bind'                       # Install BIND DNS software
brew 'httpie'                     # Install HTTPie, a user-friendly HTTP client
brew 'grep'                       # Install GNU grep
brew 'tree'                       # Install tree, a directory listing command
brew 'node'                       # Install Node.js
brew 'rename'                     # Install rename, a renaming utility
brew 'zsh'                        # Install Zsh shell
brew 'git'                        # Install Git version control system
brew 'git-lfs'                    # Install Git Large File Storage
brew 'imagemagick'                # Install ImageMagick, a tool for image manipulation
brew 'wget'                       # Install wget, a network downloader
brew 'yt-dlp'                     # Install yt-dlp, a YouTube video downloader
brew 'powerlevel10k'              # Install Powerlevel10k, a Zsh theme
brew 'speedtest-cli'              # Install Speedtest CLI, a command-line interface for testing internet bandwidth
brew 'ruby-install'               # Install ruby-install, a tool for installing Ruby
brew 'chruby'                     # Install chruby, a Ruby version manager
brew 'direnv'                     # Install direnv, a tool for managing environment variables

cask '1password'                  # Install 1Password, a password manager
cask 'alfred'                     # Install Alfred, a productivity application
cask 'iterm2'                     # Install iTerm2, a terminal emulator
cask 'notunes'                    # Install NoTunes, a utility to prevent iTunes from opening
cask 'obsidian'                   # Install Obsidian, a note-taking app
cask 'rectangle'                  # Install Rectangle, a window management app
cask 'slack'                      # Install Slack, a messaging app for teams
cask 'spotify'                    # Install Spotify, a music streaming service
cask 'visual-studio-code'         # Install Visual Studio Code, a code editor
cask 'vlc'                        # Install VLC, a media player
cask 'zoom'                       # Install Zoom, a video conferencing app