cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'teamookla/speedtest'

brew 'bind'
brew 'chruby'
brew 'coreutils'
brew 'direnv'
brew 'findutils'
brew 'fnm'
brew 'git'
brew 'git-lfs'
brew 'googleworkspace-cli'
brew 'gradle'
brew 'grep'
brew 'httpie'
brew 'imagemagick'
brew 'moreutils'
brew 'powerlevel10k'
brew 'rename'
brew 'ruby-install'
brew 'speedtest-cli'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yt-dlp'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'iterm2'
cask 'notunes'
cask 'obsidian'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
